src/test/resources/apiXml/JLR/GetJobAddOns.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:men="http://www.cliffordthames.com/ebusiness/menus/">
   <soapenv:Header/>
   <soapenv:Body>
      <getJobAddOns xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <jobAddOnsRequest>
            <men:dealerDetails countryCode="GB" dealerIdentificationCode="Automation" languageCode="EN" manufacturer="JLR" password="O3Cg0d3l751" user="Automation" vehicleFileID="0"/>
            <vehicleMatch>
               <vinMatch>SALLDBNS7BA825461</vinMatch>
            </vehicleMatch>
            <job core="false" description="" id="101005005005" jobSource="MAN" service="false"/>
         </jobAddOnsRequest>
      </getJobAddOns>
   </soapenv:Body>
</soapenv:Envelope>